{
  "source": {
    "label": "Google Reviews",
    "url": "https://www.google.com/search?sca_esv=e4930b54a8b6c4ed&rlz=1C1CHBF_enGB1061GB1061&si=AL3DRZEsmMGCryMMFSHJ3StBhOdZ2-6yYkXd_doETEE1OR-qOfK3U-UIQxhND-VxSHZBdxfr9NN09ZQzrNQTE49wTjJu3Wcr0bGaOcldG56e2mkThOANeWCE_0FXdHXvVX7Ud3aF3MUW&q=Future+Perfect+Reviews&sa=X&ved=2ahUKEwiMuPvU9JCSAxXvXUEAHfjIFtgQ0bkNegQIOBAH&biw=1101&bih=770&dpr=1.56&aic=0#cobssid=s",
    "ratingValue": 5.0,
    "reviewCount": 27
  },
  "reviews": [
    {
      "author": "Alpa Boricha",
      "rating": 5,
      "text": "Fantastic and amazing. My son has made a lot of progress and feels more confident. Great with kids."
    },
    {
      "author": "Shweta Shrigiriwar",
      "rating": 5,
      "text": "A fantastic Year 3 tuition team — very patient, engaging, and fun. My son enjoys every lesson and stays motivated. We’re very happy with his progress. Highly recommend."
    },
    {
      "author": "Jenny Hughes",
      "rating": 5,
      "text": "I have been really impressed with the maths sessions. My daughter is so much more confident and enjoys her lessons. The teaching is enthusiastic, patient, and makes hard things feel easy — she said, “he doesn’t expect me to know the answer straight away; he helps us.” Highly recommend."
    },
    {
      "author": "Thomas Woodvine",
      "rating": 5,
      "text": "At the start of Year 4 our son lacked confidence and struggled with maths. After a trial session, over the next year and a half he has grown massively in confidence and maths skills. He enjoys the interaction and the reward system really motivates him. We couldn’t be happier — highly recommend."
    },
    {
      "author": "Preeti Rathi",
      "rating": 5,
      "text": "I’m extremely pleased and highly recommend Future Perfect Tuitions to parents looking for the best start for their child’s 11+ journey."
    },
    {
      "author": "Swati Gupta Karia",
      "rating": 5,
      "text": "My 7-year-old has shown great improvement in both skills and confidence. The approach is supportive, patient, and child-friendly, making concepts easy and enjoyable. Well-structured lessons keep young learners engaged."
    },
    {
      "author": "Rida Khurshid",
      "rating": 5,
      "text": "Best teacher one could have. Sej sir engages kids during class and helps them understand the concept, which keeps them motivated to achieve their goals."
    },
    {
      "author": "Mayank Rohini",
      "rating": 5,
      "text": "Professional and very organised. Structured lessons with revision built into homework and across the term. Rewards motivate the children and group classes are the perfect size. Thank you Sej and Barkha."
    },
    {
      "author": "Cwoody",
      "rating": 5,
      "text": "The difference in just a few months has been amazing — our daughter has come on leaps and bounds in ability and confidence. Communication is second to none, and the lesson recap videos help us support homework. Can’t recommend enough."
    },
    {
      "author": "Nidhi Budki",
      "rating": 5,
      "text": "So glad we discovered Future Perfect. My child flourished in maths and English thanks to the right guidance and genuine interest from the tutors. We tried others and these guys are top notch."
    },
    {
      "author": "Tanvi Kothari",
      "rating": 5,
      "text": "Excellent tutors with passion, drive, and motivation for the kids. Our son is thriving and doing well. Thank you Barkha and Sej."
    },
    {
      "author": "Gurunanuj Anuj",
      "rating": 5,
      "text": "Highly recommend. Focus not only on exam techniques but also on developing core skills in Maths, English, VR and NVR. They break down complex topics into steps and teach the ‘why’ behind answers — not memorisation. Personalised attention and regular assessments are very helpful."
    },
    {
      "author": "Ruby Sahney",
      "rating": 5,
      "text": "Great experience with Sej & Barkha. My son has made huge progress and thoroughly enjoys his classes. The rewarding teaching style and personal touch encourage kids to perform better and gain confidence."
    },
    {
      "author": "Shyna Arora",
      "rating": 5,
      "text": "Wonderful experience with 11+ preparation. The tutors encourage, support, and patiently work with children. My son now calls education ‘fun’ and has made noticeable progress in focus and confidence. Creative rewards keep learning engaging. Highly recommend."
    },
    {
      "author": "Markus V",
      "rating": 5,
      "text": "Very good sessions with well-structured lessons and homework tailored for better understanding. We also appreciated the flexibility in exceptional circumstances."
    },
    {
      "author": "Masuma Chomoko",
      "rating": 5,
      "text": "Patient, friendly, and kind. Barkha has supported my daughter’s learning and I would recommend her to friends and family."
    },
    {
      "author": "Ervisa Rama",
      "rating": 5,
      "text": "Barkha is an amazing and professional online tutor. My daughter struggled with maths and has gained confidence and improved a lot. She’s happy with online tutoring and it’s had a huge positive impact."
    },
    {
      "author": "Mukesh Issrani",
      "rating": 5,
      "text": "We trialled multiple tutors for our daughter’s 11+ journey and should have joined Future Perfect earlier. Sej got her back on track and made learning enjoyable. They understand each child’s journey and tailor their technique. Confidence is much higher and she looks forward to lessons and homework."
    },
    {
      "author": "Hemal Parikh",
      "rating": 5,
      "text": "My daughter attends Year 4 English tuition and enjoys it because it’s very interactive. Personal attention is excellent."
    },
    {
      "author": "Gunjan Agarwal",
      "rating": 5,
      "text": "They focus on a child’s strengths and weaknesses and we get regular updates on what to work on at home. Massive improvement in maths and English."
    },
    {
      "author": "Akash B",
      "rating": 5,
      "text": "So glad we chose Future Perfect for 11+ prep. Great system and teaching style — my daughter improved immensely in English and is very strong in maths. They also guide on school recommendations. Definitely recommend."
    },
    {
      "author": "Baldev Patel",
      "rating": 5,
      "text": "Since enrolling for 11+ preparation, my daughter has shown significant improvement in maths and English. The engaging methods (games and puzzles) keep children focused and make concepts easier to grasp. Helpful follow-up on homework and feedback."
    },
    {
      "author": "Shelley Tong",
      "rating": 5,
      "text": "My son loves going to tuition and enjoys the fun teaching style. He has improved with his English and we’re looking forward to continuing."
    },
    {
      "author": "K G",
      "rating": 5,
      "text": "Excellent tutors — we’ve seen a big difference. Sitting in for the trial lesson gave confidence in their teaching approach. Creative and fun methods motivate children to learn and understand. First time I’ve seen my brother looking forward to study."
    },
    {
      "author": "Matt Davey",
      "rating": 5,
      "text": "Excellent tutors — really helped my son’s confidence. Highly recommended."
    },
    {
      "author": "Char Beedle",
      "rating": 5,
      "text": "My daughter has really enjoyed tutoring. We’ve seen a big difference in confidence and ability since starting. Would recommend to other parents."
    },
    {
      "author": "Priya Kalia",
      "rating": 5,
      "text": "Great tutoring service. My daughter started shy with weaknesses which are being addressed; she’s now more confident and happier. Barkha is kind but firm, quickly identifies weaknesses, and doesn’t move on until she understands. Highly recommend."
    }
  ]
}
